CREATE DATABASE  IF NOT EXISTS `POCHA_DB` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `POCHA_DB`;
-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: pocha.c2dmjuulvzgw.ap-northeast-2.rds.amazonaws.com    Database: POCHA_DB
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ '';

--
-- Table structure for table `region`
--

DROP TABLE IF EXISTS `region`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `region` (
  `region_code` varchar(255) NOT NULL,
  `gugun_name` varchar(255) DEFAULT NULL,
  `sido_name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`region_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `region`
--

LOCK TABLES `region` WRITE;
/*!40000 ALTER TABLE `region` DISABLE KEYS */;
INSERT INTO `region` VALUES ('1100000000',NULL,'서울특별시'),('2600000000',NULL,'부산광역시'),('2700000000',NULL,'대구광역시'),('2800000000',NULL,'인천광역시'),('2900000000',NULL,'광주광역시'),('3000000000',NULL,'대전광역시'),('3100000000',NULL,'울산광역시'),('4100000000',NULL,'경기도'),('4111000000','수원시','경기도'),('4113000000','성남시','경기도'),('4115000000','의정부시','경기도'),('4117000000','안양시','경기도'),('4119000000','부천시','경기도'),('4121000000','광명시','경기도'),('4122000000','평택시','경기도'),('4125000000','동두천시','경기도'),('4127000000','안산시','경기도'),('4128000000','고양시','경기도'),('4129000000','과천시','경기도'),('4131000000','구리시','경기도'),('4136000000','남양주시','경기도'),('4137000000','오산시','경기도'),('4139000000','시흥시','경기도'),('4141000000','군포시','경기도'),('4143000000','의왕시','경기도'),('4145000000','하남시','경기도'),('4146000000','용인시','경기도'),('4148000000','파주시','경기도'),('4150000000','이천시','경기도'),('4155000000','안성시','경기도'),('4157000000','김포시','경기도'),('4159000000','화성시','경기도'),('4161000000','광주시','경기도'),('4163000000','양주시','경기도'),('4165000000','포천시','경기도'),('4167000000','여주시','경기도'),('4180000000','연천군','경기도'),('4182000000','가평군','경기도'),('4183000000','양평군','경기도'),('4200000000',NULL,'강원도'),('4211000000','춘천시','강원도'),('4213000000','원주시','강원도'),('4215000000','강릉시','강원도'),('4217000000','동해시','강원도'),('4219000000','태백시','강원도'),('4221000000','속초시','강원도'),('4223000000','삼척시','강원도'),('4272000000','홍천군','강원도'),('4273000000','횡성군','강원도'),('4275000000','영월군','강원도'),('4276000000','평창군','강원도'),('4277000000','정선군','강원도'),('4278000000','철원군','강원도'),('4279000000','화천군','강원도'),('4280000000','양구군','강원도'),('4281000000','인제군','강원도'),('4282000000','고성군','강원도'),('4283000000','양양군','강원도'),('4300000000',NULL,'충청북도'),('4311000000','청주시','충청북도'),('4313000000','충주시','충청북도'),('4315000000','제천시','충청북도'),('4372000000','보은군','충청북도'),('4373000000','옥천군','충청북도'),('4374000000','영동군','충청북도'),('4375000000','진천군','충청북도'),('4376000000','괴산군','충청북도'),('4377000000','음성군','충청북도'),('4380000000','단양군','충청북도'),('4400000000',NULL,'충청남도'),('4413000000','천안시','충청남도'),('4415000000','공주시','충청남도'),('4418000000','보령시','충청남도'),('4420000000','아산시','충청남도'),('4421000000','서산시','충청남도'),('4423000000','논산시','충청남도'),('4425000000','계룡시','충청남도'),('4427000000','당진시','충청남도'),('4471000000','금산군','충청남도'),('4476000000','부여군','충청남도'),('4477000000','서천군','충청남도'),('4479000000','청양군','충청남도'),('4480000000','홍성군','충청남도'),('4481000000','예산군','충청남도'),('4482500000','태안군','충청남도'),('4500000000',NULL,'전라북도'),('4511000000','전주시','전라북도'),('4513000000','군산시','전라북도'),('4514000000','익산시','전라북도'),('4518000000','정읍시','전라북도'),('4519000000','남원시','전라북도'),('4521000000','김제시','전라북도'),('4571000000','완주군','전라북도'),('4572000000','진안군','전라북도'),('4573000000','무주군','전라북도'),('4574000000','장수군','전라북도'),('4575000000','임실군','전라북도'),('4577000000','순창군','전라북도'),('4579000000','고창군','전라북도'),('4580000000','부안군','전라북도'),('4600000000',NULL,'전라남도'),('4611000000','목포시','전라남도'),('4613000000','여수시','전라남도'),('4615000000','순천시','전라남도'),('4617000000','나주시','전라남도'),('4623000000','광양시','전라남도'),('4671000000','담양군','전라남도'),('4672000000','곡성군','전라남도'),('4673000000','구례군','전라남도'),('4677000000','고흥군','전라남도'),('4678000000','보성군','전라남도'),('4679000000','화순군','전라남도'),('4680000000','장흥군','전라남도'),('4681000000','강진군','전라남도'),('4682000000','해남군','전라남도'),('4683000000','영암군','전라남도'),('4684000000','무안군','전라남도'),('4686000000','함평군','전라남도'),('4687000000','영광군','전라남도'),('4688000000','장성군','전라남도'),('4689000000','완도군','전라남도'),('4690000000','진도군','전라남도'),('4691000000','신안군','전라남도'),('4700000000',NULL,'경상북도'),('4711000000','포항시','경상북도'),('4713000000','경주시','경상북도'),('4715000000','김천시','경상북도'),('4717000000','안동시','경상북도'),('4719000000','구미시','경상북도'),('4721000000','영주시','경상북도'),('4723000000','영천시','경상북도'),('4725000000','상주시','경상북도'),('4728000000','문경시','경상북도'),('4729000000','경산시','경상북도'),('4772000000','군위군','경상북도'),('4773000000','의성군','경상북도'),('4775000000','청송군','경상북도'),('4776000000','영양군','경상북도'),('4777000000','영덕군','경상북도'),('4782000000','청도군','경상북도'),('4783000000','고령군','경상북도'),('4784000000','성주군','경상북도'),('4785000000','칠곡군','경상북도'),('4790000000','예천군','경상북도'),('4792000000','봉화군','경상북도'),('4793000000','울진군','경상북도'),('4794000000','울릉군','경상북도'),('4800000000',NULL,'경상남도'),('4812000000','창원시','경상남도'),('4817000000','진주시','경상남도'),('4822000000','통영시','경상남도'),('4824000000','사천시','경상남도'),('4825000000','김해시','경상남도'),('4827000000','밀양시','경상남도'),('4831000000','거제시','경상남도'),('4833000000','양산시','경상남도'),('4872000000','의령군','경상남도'),('4873000000','함안군','경상남도'),('4874000000','창녕군','경상남도'),('4882000000','고성군','경상남도'),('4884000000','남해군','경상남도'),('4885000000','하동군','경상남도'),('4886000000','산청군','경상남도'),('4887000000','함양군','경상남도'),('4888000000','거창군','경상남도'),('4889000000','합천군','경상남도'),('5000000000',NULL,'제주특별자치도');
/*!40000 ALTER TABLE `region` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-17 11:20:23
